tap "homebrew/bundle"

# cli
brew "direnv"
brew "eza"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "ghq"
brew "git"
brew "git-delta"
brew "htop"
brew "imagemagick"
brew "just"
brew "mas"
brew "mise"
brew "neofetch"
brew "neovim"
brew "pulumi"
brew "starship"
brew "stow"
brew "terraform"
brew "wget"

# casks
cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "betterdisplay"
cask "discord"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "jellyfin-media-player"
cask "jetbrains-toolbox"
cask "orbstack"
cask "rectangle"
cask "shottr"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "tailscale"
cask "utm"
cask "visual-studio-code"

# not listed in brew
# - Tinkertool
# - Jagex Launcher

# mac app store
mas "adguard", id: 1440147259
mas "bitwarden", id: 1352778147
mas "dayone", id: 1055511498
mas "numbers", id: 409203825
mas "velja", id: 1607635845
mas "wireguard", id: 1451685025
mas "xcode", id: 497799835
