tap "homebrew/bundle"

# cli
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "ghq"
brew "git"
brew "git-delta"
brew "htop"
brew "imagemagick"
brew "just"
brew "mas"
brew "mise"
brew "neofetch"
brew "neovim"
brew "pulumi"
brew "starship"
brew "stow"
brew "terraform"
brew "wget"
brew "yt-dlp"

# Global casks
cask "appcleaner"
cask "betterdisplay"
cask "firefox"
cask "hiddenbar"
cask "iterm2"
cask "rectangle"
cask "sonos"
cask "tailscale"
cask "todoist"
cask "utm"
cask "visual-studio-code"
cask "wezterm"
cask "zed"

cask "nikitabobko/tap/aerospace"

# Work casks
cask "1password" # Must be installed in /Applications
cask "arc", args: { appdir: "~/Applications" }
cask "google-chrome", args: { appdir: "~/Applications" }
cask "google-cloud-sdk" # Must be installed in /Applications
cask "jetbrains-toolbox", args: { appdir: "~/Applications" }
cask "obsidian", args: { appdir: "~/Applications" }
cask "orbstack", args: { appdir: "~/Applications" }
cask "postman", args: { appdir: "~/Applications" }
cask "shottr", args: { appdir: "~/Applications" }
cask "slack", args: { appdir: "~/Applications" }

# not listed in brew
# - Tinkertool

# mac app store
mas "amphetamine", id: 937984704
mas "bitwarden", id: 1352778147 # must come from MAS for extensions
mas "numbers", id: 409203825
mas "velja", id: 1607635845
mas "xcode", id: 497799835
