tap "homebrew/bundle"

# cli
brew "7zip"
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "ghq"
brew "git"
brew "git-delta"
brew "htop"
brew "imagemagick"
brew "just"
brew "mas"
brew "mise"
brew "neofetch"
brew "neovim"
brew "pulumi"
brew "starship"
brew "stow"
brew "terraform"
brew "wget"
brew "yt-dlp"

# Global casks
cask "alfred"
cask "appcleaner"
cask "betterdisplay"
cask "firefox"
cask "hiddenbar"
cask "iterm2"
cask "rectangle"
cask "sonos"
cask "tailscale"
cask "todoist"
cask "utm"
cask "visual-studio-code"
cask "wezterm"
cask "zed"

cask "nikitabobko/tap/aerospace"

# Work casks
cask "1password" # Must be installed in /Applications
cask "arc"
cask "claude"
cask "dbeaver-community"
cask "google-chrome"
cask "google-cloud-sdk" # Must be installed in /Applications
cask "jetbrains-toolbox"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "shottr"
cask "slack"

# Personal casks
cask "autodesk-fusion"
cask "bambu-studio"
cask "blender"
cask "discord"
cask "iina"
cask "signal"
cask "transmission"

# not listed in brew
# - Tinkertool

# mac app store
mas "amphetamine", id: 937984704
mas "bitwarden", id: 1352778147 # must come from MAS for extensions
mas "numbers", id: 409203825
mas "velja", id: 1607635845
mas "xcode", id: 497799835
